app/controllers/commutes_controller.rb

SELECT * FROM `commutes` WHERE (`commutes`.project_id = 1)
SELECT count(*) AS count_all FROM `commutes` WHERE (`commutes`.project_id = 2)
---
  def index
    @commutes = @project.commutes.paginate :page => params[:page], :order => 'created_at DESC'

INSERT INTO `commutes` (`name`, `created_at`, `commute_type`, `project_id`, `updated_at`, `carbon_output_cache`, `amee_profile_item_id`) VALUES('Tube to work', '2009-11-23 12:12:44', 'tube', 2, '2009-11-23 12:12:44', 0.690409, '933AC2805745')
---
  def create
    @commute = @project.commutes.new(params[:commute])
    if @commute.save

SELECT * FROM `commutes` WHERE (`commutes`.`id` = 24 AND (`commutes`.project_id = 2))
---
  def edit
    @commute = @project.commutes.find(params[:id])

SELECT * FROM `commutes` WHERE (`commutes`.`id` = 24 AND (`commutes`.project_id = 2))
UPDATE `commutes` SET `updated_at` = '2009-11-23 16:23:29', `name` = 'London -> Newark', `carbon_output_cache` = 10.386 WHERE `id` = 26
---
  def update
    @commute = @project.commutes.find(params[:id])
    if @commute.update_attributes(params[:commute])

SELECT * FROM `commutes` WHERE (`commutes`.`id` = 23 AND (`commutes`.project_id = 2))
DELETE FROM `commutes` WHERE `id` = 23
---
  def destroy
    @commute = @project.commutes.find(params[:id])
    @commute.destroy