app/controllers/energy_consumptions_controller.rb

SELECT * FROM `energy_consumptions` WHERE (`energy_consumptions`.`id` = 1 AND (`energy_consumptions`.project_id = 2))
---
  def show
    @energy_consumption = @project.energy_consumptions.find(params[:id])