app/controllers/energy_consumptions_controller.rb

  def index
    @energy_consumptions = @project.energy_consumptions.paginate :page => params[:page], :order => 'created_at DESC'
---
SELECT * FROM `energy_consumptions` WHERE (`energy_consumptions`.project_id = 2)

  def create
    @energy_consumption = @project.energy_consumptions.new(params[:energy_consumption])
    if @energy_consumption.save
---
INSERT INTO `energy_consumptions` (`name`, `created_at`, `project_id`, `updated_at`, `carbon_output_cache`, `amee_profile_item_id`, `energy_consumption_type`) VALUES('my gas', '2009-11-23 12:09:23', 2, '2009-11-23 12:09:23', 0.2009, '1C3D8499E325', 'gas')

  def edit
    @energy_consumption = @project.energy_consumptions.find(params[:id])
---
SELECT * FROM `energy_consumptions` WHERE (`energy_consumptions`.`id` = 3 AND (`energy_consumptions`.project_id = 2))

  def update
    @energy_consumption = @project.energy_consumptions.find(params[:id])
    if @energy_consumption.update_attributes(params[:energy_consumption])
---
SELECT * FROM `energy_consumptions` WHERE (`energy_consumptions`.`id` = 4 AND (`energy_consumptions`.project_id = 2))
UPDATE `energy_consumptions` SET `updated_at` = '2009-11-24 09:58:35', `name` = 'Backup generator number 1', `carbon_output_cache` = 197.9325 WHERE `id` = 4

  def destroy
    @energy_consumption = @project.energy_consumptions.find(params[:id])
    @energy_consumption.destroy
---
SELECT * FROM `energy_consumptions` WHERE (`energy_consumptions`.`id` = 4 AND (`energy_consumptions`.project_id = 2))
DELETE FROM `energy_consumptions` WHERE `id` = 4