app/controllers/passwords_controller.rb

SELECT `users`.id FROM `users` WHERE (`users`.`email` = BINARY 'george.palmer@gmail.com' AND `users`.id <> 1) LIMIT 1
INSERT INTO `passwords` (`expiration_date`, `created_at`, `updated_at`, `user_id`, `reset_code`) VALUES('2009-11-30 14:57:25', '2009-11-16 14:57:25', '2009-11-16 14:57:25', 1, 'cacde0fd49d343ce95f6982955384889345f6847')
---
  def create
    @password = Password.new(params[:password])
    @password.user = User.find_by_email(@password.email)

    respond_to do |format|
      if @password.save

SELECT * FROM `passwords` WHERE (reset_code = '70312f749727aa2fd6a45220615f0cbe1e719b1f' and expiration_date > '2009-11-16 15:01:07') LIMIT 1
SELECT * FROM `users` WHERE (`users`.`id` = 1)
---
  def reset
    @user = Password.find(:first, :conditions => ['reset_code = ? and expiration_date > ?', params[:reset_code], Time.now]).user

SELECT * FROM `passwords` WHERE (`passwords`.`reset_code` = '70312f749727aa2fd6a45220615f0cbe1e719b1f') LIMIT 1
DELETE FROM `passwords` WHERE `id` = 3
---
  def update_after_forgetting
    @password = Password.find_by_reset_code(params[:reset_code])
    @user = @password.user unless @password.nil?

    respond_to do |format|
      if @user.update_attributes(params[:user])
        @password.destroy