app/controllers/projects_controller.rb

SELECT * FROM `projects` WHERE (`projects`.`id` = 1 AND (`projects`.client_id = 1))
---
  def find_project
    @project = @client.projects.find(params[:id])